from enum import StrEnum


class Actions(StrEnum):
    IDENTITY_DOCUMENT_TYPE_LIST = ("identity_document_type:list", "Перегляд списку типів паспортів", "Дозволяє перегляд списку типів паспортів")
    IDENTITY_DOCUMENT_TYPE_ADD = ("identity_document_type:add", "Додавання типів паспортів", "Дозволяє додавання нових типів паспортів")
    IDENTITY_DOCUMENT_TYPE_EDIT = ("identity_document_type:edit", "Редагування типів паспортів", "Дозволяє редагування існуючих типів паспортів")
    IDENTITY_DOCUMENT_TYPE_DELETE = ("identity_document_type:delete", "Видалення типів паспортів", "Дозволяє видалення існуючих типів паспортів")
    IDENTITY_DOCUMENT_TYPE_VIEW = ("identity_document_type:view", "Перегляд деталізованої інформації про тип паспорту", "Дозволяє переглядати деталізовану інформацію про тип паспорту")

    KINSHIP_LIST = ("kinship:list", "Перегляд списку типів родичів", "Дозволяє переглядати список типів родичів")
    KINSHIP_ADD = ("kinship:add", "Додавання типів родичів", "Дозволяє додавати нові типи родичів")
    KINSHIP_EDIT = ("kinship:edit", "Редагування типів родичів", "Дозволяє редагувати типи родичів")
    KINSHIP_DELETE = ("kinship:delete", "Видалення типів родичів", "Дозволяє видаляти типи родичів")
    KINSHIP_VIEW = ("kinship:view", "Перегляд деталізованої інформації про тип родича", "Дозволяє перегляд деталізованої інформації про тип родича")

    SPECIAL_CONDITION_LIST = ("special_condition:list", "Перегляд списку спеціальних умов", "Дозволяє переглядати список спеціальних умов вступу")
    SPECIAL_CONDITION_ADD = ("special_condition:add", "Додавання спеціальних умов", "Дозволяє додавати нові спеціальні умови вступу")
    SPECIAL_CONDITION_EDIT = ("special_condition:edit", "Редагування спеціальних умов", "Дозволяє редагувати спеціальні умови вступу")
    SPECIAL_CONDITION_DELETE = ("special_condition:delete", "Видалення спеціальних умов", "Дозволяє видаляти спеціальні умови вступу")
    SPECIAL_CONDITION_VIEW = ("special_condition:view", "Перегляд деталізованої інформації про спеціальну умову", "Дозволяє перегляд деталізованої інформації про спеціальну умову вступу")

    SOURCE_OF_FUNDING_LIST = ("source_of_funding:list", "Перегляд списку джерел фінансування", "Дозволяє переглядати список джерел фінансування")
    SOURCE_OF_FUNDING_ADD = ("source_of_funding:add", "Додавання джерел фінансування", "Дозволяє додавати нові джерела фінансування")
    SOURCE_OF_FUNDING_EDIT = ("source_of_funding:edit", "Редагування джерел фінансування", "Дозволяє редагувати джерела фінансування")
    SOURCE_OF_FUNDING_DELETE = ("source_of_funding:delete", "Видалення джерел фінансування", "Дозволяє видаляти джерела фінансування")
    SOURCE_OF_FUNDING_VIEW = ("source_of_funding:view", "Перегляд деталізованої інформації про джерело фінансування", "Дозволяє перегляд деталізованої інформації про джерело фінансування")

    DEPARTMENT_LIST = ("department:list", "Перегляд списку відділень", "Дозволяє переглядати список відділень")
    DEPARTMENT_ADD = ("department:add", "Додавання відділень", "Дозволяє додавати нові відділення")
    DEPARTMENT_EDIT = ("department:edit", "Редагування відділень", "Дозволяє редагувати відділення")
    DEPARTMENT_DELETE = ("department:delete", "Видалення відділень", "Дозволяє видаляти відділення")
    DEPARTMENT_VIEW = ("department:view", "Перегляд деталізованої інформації про відділення", "Дозволяє перегляд деталізованої інформації про відділення")

    SPECIALITY_LIST = ("speciality:list", "Перегляд списку спеціальностей", "Дозволяє переглядати список спеціальностей")
    SPECIALITY_ADD = ("speciality:add", "Додавання спеціальностей", "Дозволяє додавати нові спеціальності")
    SPECIALITY_EDIT = ("speciality:edit", "Редагування спеціальностей", "Дозволяє редагувати спеціальності")
    SPECIALITY_DELETE = ("speciality:delete", "Видалення спеціальностей", "Дозволяє видаляти спеціальності")
    SPECIALITY_VIEW = ("speciality:view", "Перегляд деталізованої інформації про спеціальність", "Дозволяє перегляд деталізованої інформації про спеціальність")

    APPLICATION_STATUS_LIST = ("application_status:list", "Перегляд списку статусів заявок", "Дозволяє переглядати список статусів заявок абітурієнтів")
    APPLICATION_STATUS_ADD = ("application_status:add", "Додавання статусів заявок", "Дозволяє додавати нові статуси заявок абітурієнтів")
    APPLICATION_STATUS_EDIT = ("application_status:edit", "Редагування статусів заявок", "Дозволяє редагувати статуси заявок абітурієнтів")
    APPLICATION_STATUS_DELETE = ("application_status:delete", "Видалення статусів заявок", "Дозволяє видаляти статуси заявок абітурієнтів")
    APPLICATION_STATUS_VIEW = ("application_status:view", "Перегляд деталізованої інформації про статус заявки", "Дозволяє перегляд деталізованої інформації про статус заявки абітурієнта")

    ITEM_ZNO_LIST = ("item_zno:list", "Перегляд списку предметів ЗНО", "Дозволяє переглядати список предметів ЗНО")
    ITEM_ZNO_ADD = ("item_zno:add", "Додавання предметів ЗНО", "Дозволяє додавати нові предмети ЗНО")
    ITEM_ZNO_EDIT = ("item_zno:edit", "Редагування предметів ЗНО", "Дозволяє редагувати предмети ЗНО")
    ITEM_ZNO_DELETE = ("item_zno:delete", "Видалення предметів ЗНО", "Дозволяє видаляти предмети ЗНО")
    ITEM_ZNO_VIEW = ("item_zno:view", "Перегляд деталізованої інформації про предмет ЗНО", "Дозволяє перегляд деталізованої інформації про предмет ЗНО")

    ENTRY_BASE_LIST = ("entry_base:list", "Перегляд списку баз вступу", "Дозволяє переглядати список баз вступу")
    ENTRY_BASE_ADD = ("entry_base:add", "Додавання баз вступу", "Дозволяє додавати нові бази вступу")
    ENTRY_BASE_EDIT = ("entry_base:edit", "Редагування баз вступу", "Дозволяє редагувати бази вступу")
    ENTRY_BASE_DELETE = ("entry_base:delete", "Видалення баз вступу", "Дозволяє видаляти бази вступу")
    ENTRY_BASE_VIEW = ("entry_base:view", "Перегляд деталізованої інформації про базу вступу", "Дозволяє перегляд деталізованої інформації про базу вступу")

    ENTRANTS_GROUP_LIST = ("entrants_group:list", "Перегляд списку груп ЗНО", "Дозволяє переглядати список груп абітурієнтів на ЗНО")
    ENTRANTS_GROUP_ADD = ("entrants_group:add", "Додавання груп ЗНО", "Дозволяє додавати нові групи абітурієнтів на ЗНО")
    ENTRANTS_GROUP_EDIT = ("entrants_group:edit", "Редагування груп ЗНО", "Дозволяє редагувати групи абітурієнтів на ЗНО")
    ENTRANTS_GROUP_DELETE = ("entrants_group:delete", "Видалення груп ЗНО", "Дозволяє видаляти групи абітурієнтів на ЗНО")
    ENTRANTS_GROUP_VIEW = ("entrants_group:view", "Перегляд деталізованої інформації про групу ЗНО", "Дозволяє перегляд деталізованої інформації про групу абітурієнтів на ЗНО")

    ENTRANT_EXAM_LIST = ("entrant_exam:list", "Перегляд графіка іспитів", "Дозволяє переглядати список іспитів усіх груп абітурієнтів")
    ENTRANT_EXAM_ADD = ("entrant_exam:add", "Додавання іспиту", "Дозволяє додавати новий іспит до графіка")
    ENTRANT_EXAM_EDIT = ("entrant_exam:edit", "Редагування іспиту", "Дозволяє редагувати інформацію про іспит у графіку")
    ENTRANT_EXAM_DELETE = ("entrant_exam:delete", "Видалення іспиту", "Дозволяє видаляти іспит з графіка")
    ENTRANT_EXAM_VIEW = ("entrant_exam:view", "Перегляд деталізованої інформації про іспит", "Дозволяє перегляд деталізованої інформації про іспит у графіку")

    ENTRANT_LIST = ("entrant:list", "Перегляд списку абітурієнтів", "Дозволяє переглядати список абітурієнтів")
    ENTRANT_ADD = ("entrant:add", "Додавання абітурієнтів", "Дозволяє додавати нових абітурієнтів")
    ENTRANT_EDIT = ("entrant:edit", "Редагування абітурієнтів", "Дозволяє редагувати інформацію про абітурієнтів")
    ENTRANT_DELETE = ("entrant:delete", "Видалення абітурієнтів", "Дозволяє видаляти абітурієнтів")
    ENTRANT_VIEW = ("entrant:view", "Перегляд деталізованої інформації про абітурієнта", "Дозволяє перегляд деталізованої інформації про абітурієнта")

    ADMISSION_CAMPAIGN_LIST = ("admission_campaign:list", "Перегляд списку вступних кампаній", "Дозволяє переглядати список вступних кампаній")
    ADMISSION_CAMPAIGN_ADD = ("admission_campaign:add", "Додавання вступних кампаній", "Дозволяє додавати нові вступні кампанії")
    ADMISSION_CAMPAIGN_EDIT = ("admission_campaign:edit", "Редагування вступних кампаній", "Дозволяє редагувати вступні кампанії")
    ADMISSION_CAMPAIGN_DELETE = ("admission_campaign:delete", "Видалення вступних кампаній", "Дозволяє видаляти вступні кампанії")
    ADMISSION_CAMPAIGN_VIEW = ("admission_campaign:view", "Перегляд деталізованої інформації про вступну кампанію", "Дозволяє перегляд деталізованої інформації про вступну кампанію")

    ROLE_LIST = ("role:list", "Перегляд списку ролей", "Дозволяє перегляд списку ролей")
    ROLE_ADD = ("role:add", "Додавання ролей", "Дозволяє додавати нові ролі")
    ROLE_EDIT = ("role:edit", "Редагування ролей", "Дозволяє редагувати існуючі ролі")
    ROLE_DELETE = ("role:delete", "Видалення ролей", "Дозволяє видаляти існуючі ролі")
    ROLE_VIEW = ("role:view", "Детальний перегляд ролей", "Дозволяє перегляд детальної інформації про ролі")

    RATING_VIEW = ("rating:view", "Перегляд рейтингового списку", "Дозволяє переглядати рейтинговий список абітурієнтів по спеціальностях")
    RATING_GENERATE = ("rating:generate", "Формування рейтингового списку", "Дозволяє запускати формування рейтингового списку для вступної кампанії")

    WORKER_LIST = ("worker:list", "Перегляд списку користувачів", "Дозволяє перегляд списку користувачів")
    WORKER_ADD = ("worker:add", "Додавання користувачів", "Дозволяє додавати нових користувачів")
    WORKER_EDIT = ("worker:edit", "Редагування користувачів", "Дозволяє редагування існуючих користувачів")
    WORKER_DELETE = ("worker:delete", "Видалення користувачів", "Дозволяє видалення існуючих користувачів")
    WORKER_VIEW = ("worker:view", "Детальний перегляд користувачів", "Дозволяє переглядати деталізованої інформації про користувачів")

    def __new__(cls, code: str, title: str, description: str):
        obj = str.__new__(cls, code)
        obj._value_ = code
        obj.title_attr = title
        obj.description_attr = description
        return obj
